ugomancz/old_muni_code/Onechip controllers/HW11/UDP/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 transmit data source select: UART0_TX pin */

/*! @name PORTB16 (coord E10), U7[4]/UART0_RX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DEBUG_UART_RX_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DEBUG_UART_RX_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DEBUG_UART_RX_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORTB17 (coord E9), U10[1]/UART0_TX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DEBUG_UART_TX_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DEBUG_UART_TX_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DEBUG_UART_TX_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORTA12 (coord K9), U13[12]/RMII0_RXD1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RMII0_RXD1_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RMII0_RXD1_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RMII0_RXD1_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORTA13 (coord J9), U13[13]/RMII0_RXD0
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RMII0_RXD0_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RMII0_RXD0_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RMII0_RXD0_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORTA14 (coord L10), U13[15]/RMII0_CRS_DV
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RMII0_CRS_DV_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RMII0_CRS_DV_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RMII0_CRS_DV_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORTA15 (coord L11), U13[19]/RMII0_TXEN
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RMII0_TXEN_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RMII0_TXEN_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RMII0_TXEN_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORTA16 (coord K10), U13[20]/RMII0_TXD_0
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RMII0_TXD_0_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RMII0_TXD_0_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RMII0_TXD_0_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORTA17 (coord K11), U13[21]/RMII0_TXD_1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RMII0_TXD_1_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RMII0_TXD_1_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RMII0_TXD_1_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORTA5 (coord M8), U13[17]/RMII0_RXER
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RMII0_RXER_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RMII0_RXER_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RMII0_RXER_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORTB0 (coord H10), U13[10]/RMII0_MDIO
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RMII0_MDIO_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RMII0_MDIO_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RMII0_MDIO_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORTB1 (coord H9), U13[11]/RMII0_MDC
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RMII0_MDC_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RMII0_MDC_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RMII0_MDC_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTB7 (coord F11), J4[2]/ADC1_SE13
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ADC1_SE13_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ADC1_SE13_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ADC1_SE13_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
